[
  {
    "name": "Calories Tracker",
    "url": "https://calorie-tracker-xi.vercel.app/",
    "desc": "Developed an calories tracker which provide users with array of tool too manage there calories intake and create diet plan along with that users can log there daily activity, food etc. for better accessing there diet. Also users can subscribe to the premium subscription to get personalized diet plans for there requirements.",
    "small_desc": "Developed an calories tracker which provide users with array of tool too manage there calories intake",
    "features": [
      { "name": "User Authentication", "detail": "Users can register and log in using their Spotify accounts. OAuth 2.0 authentication ensures secure and seamless login via Spotify." },
      {
        "name": "User Profiles",
        "detail": "Users have customizable profiles displaying their favorite lists, albums, recently played tracks, and added playlists. Profiles can be followed by other users, creating a network of music enthusiasts. Users can update their profile information, including name and personal details."
      },
      {
        "name": "Social Interactions",
        "detail": "Users can comment on songs, albums, and playlists, fostering discussions and sharing opinions. Users can rate songs and artists, contributing to the community's collective preferences. A feed section shows the latest activities of followed users, such as comments, ratings, and song shares. Users can share songs with their followers, similar to Instagram's reel share option."
      },
      {
        "name": "Integration with Spotify",
        "detail": "Users can see their Spotify playlists and recent tracks directly on the webapp. The app utilizes Spotify API to fetch real-time data, ensuring a seamless integration of Spotify features. Song search functionality is provided, fetching results directly from the Spotify API."
      },
      {
        "name": "Feed Section",
        "detail": "A dynamic feed displays activities from followed users, including their comments, ratings, and song shares. Users can interact with the feed by liking or commenting on activities."
      },
      {
        "name": "Song Search",
        "detail": "Users can search for songs within the webapp. Search results are fetched directly from the Spotify API, ensuring up-to-date and accurate information. Users can search for songs, artists, and other users within the webapp."
      }
    ],
    "tech_stack": ["HTML5", "CSS3", "AWS Lambda", "ChartJS"],
    "video": "false",
    "images": [
      "https://portfolio-fiverr-self.vercel.app/cal3.jpg",
      "https://portfolio-fiverr-self.vercel.app/cal4.jpg",
      "https://portfolio-fiverr-self.vercel.app/cal1.jpg",
      "https://portfolio-fiverr-self.vercel.app/cal2.jpg"
    ]
  },
  {
    "name": "Music Rating app",
    "url": "https://critiq.se/",
    "desc": "Critiq is a dynamic music-focused social web application that transforms the way users engage with and discover music. With features like song commenting, rating, personalized feeds, music sharing, and user activities, Critiq creates a vibrant community for music enthusiasts. The seamless integration of Spotify through the Spotify API enhances the user experience, providing access to a vast music library.",
    "small_desc": "Critiq is a dynamic music-focused social web application",
    "features": [
      { "name": "User Authentication", "detail": "Users can register and log in using their Spotify accounts. OAuth 2.0 authentication ensures secure and seamless login via Spotify." },
      {
        "name": "User Profiles",
        "detail": "Users have customizable profiles displaying their favorite lists, albums, recently played tracks, and added playlists. Profiles can be followed by other users, creating a network of music enthusiasts. Users can update their profile information, including name and personal details."
      },
      {
        "name": "Social Interactions",
        "detail": "Users can comment on songs, albums, and playlists, fostering discussions and sharing opinions. Users can rate songs and artists, contributing to the community's collective preferences. A feed section shows the latest activities of followed users, such as comments, ratings, and song shares. Users can share songs with their followers, similar to Instagram's reel share option."
      },
      {
        "name": "Integration with Spotify",
        "detail": "Users can see their Spotify playlists and recent tracks directly on the webapp. The app utilizes Spotify API to fetch real-time data, ensuring a seamless integration of Spotify features. Song search functionality is provided, fetching results directly from the Spotify API."
      },
      {
        "name": "Feed Section",
        "detail": "A dynamic feed displays activities from followed users, including their comments, ratings, and song shares. Users can interact with the feed by liking or commenting on activities."
      },
      {
        "name": "Song Search",
        "detail": "Users can search for songs within the webapp. Search results are fetched directly from the Spotify API, ensuring up-to-date and accurate information. Users can search for songs, artists, and other users within the webapp."
      }
    ],

    "tech_stack": ["React", "Django", "Django DRF", "PostgreSQL"],
    "video": "false",
    "images": ["./crtiq_4.jpeg", "./crtiq_2.jpeg", "./crtiq_3.jpeg", "./crtiq_1.jpeg"]
  },
  {
    "name": "Art Merch Store",
    "url": "https://calorie-tracker-xi.vercel.app/",
    "desc": "Developed a small e-merch store for and idependent artist probiding him the platform to sell his print media, posters, apparels etc. App uses email js to directly send the order to the seller mail from there onward the seller can handle the user data and reuest using there CRM.",
    "small_desc": "E-merch store for and idependent artist",
    "features": [
      {
        "name": "Portfolio",
        "detail": "Artist have dynamic way to set his work with clients and personal projects"
      },
      {
        "name": "Shop",
        "detail": "Users can purchase art merch from the website."
      },
      {
        "name": "User Authentication",
        "detail": "Users can register on the site for buying and booking custom work from the artist."
      },
      {
        "name": "Contact using Emailjs",
        "detail": "User can directly contact to the artist with contact form which is integrated with email js and reduce the cost of getting a commercial email for the merch store."
      },
      {
        "name": "Cart System",
        "detail": "Users can easiyl add items to there cart for buying later or buying in bulk."
      }
    ],
    "tech_stack": ["React", "Email JS", "PHP", "MySQL"],
    "video": "false",
    "images": ["https://portfolio-fiverr-self.vercel.app/artstore.jpg", "./artMerch/1.jpg", "./artMerch/2.jpg", "./artMerch/3.jpg"]
  },
  {
    "name": "CarbonTrack",
    "url": "https://calorie-tracker-xi.vercel.app/",
    "desc": "Introducing CarbonTrack, your personal carbon emissions tracker. Easily input your monthly and yearly activities, from transportation to energy usage and diet. CarbonTrack provides comprehensive analysis, breaking down emissions by category and presenting data through intuitive charts and graphs. Set customizable reduction goals and receive insightful tips for greener living. With CarbonTrack, monitoring and managing your carbon footprint is simple and secure.",
    "small_desc": "CarbonTrack, your personal carbon emissions tracker",
    "features": [
      { "name": "User Authentication", "detail": "Users can register and log in using their Spotify accounts. OAuth 2.0 authentication ensures secure and seamless login via Spotify." },
      {
        "name": "User Profiles",
        "detail": "Users have customizable profiles displaying their favorite lists, albums, recently played tracks, and added playlists. Profiles can be followed by other users, creating a network of music enthusiasts. Users can update their profile information, including name and personal details."
      },
      {
        "name": "Social Interactions",
        "detail": "Users can comment on songs, albums, and playlists, fostering discussions and sharing opinions. Users can rate songs and artists, contributing to the community's collective preferences. A feed section shows the latest activities of followed users, such as comments, ratings, and song shares. Users can share songs with their followers, similar to Instagram's reel share option."
      },
      {
        "name": "Integration with Spotify",
        "detail": "Users can see their Spotify playlists and recent tracks directly on the webapp. The app utilizes Spotify API to fetch real-time data, ensuring a seamless integration of Spotify features. Song search functionality is provided, fetching results directly from the Spotify API."
      },
      {
        "name": "Feed Section",
        "detail": "A dynamic feed displays activities from followed users, including their comments, ratings, and song shares. Users can interact with the feed by liking or commenting on activities."
      },
      {
        "name": "Song Search",
        "detail": "Users can search for songs within the webapp. Search results are fetched directly from the Spotify API, ensuring up-to-date and accurate information. Users can search for songs, artists, and other users within the webapp."
      }
    ],
    "tech_stack": ["HTML5", "CSS3", "AWS Lambda", "ChartJS"],
    "video": "false",
    "images": ["./carbontrack/1.jpeg", "./carbontrack/2.jpeg", "./carbontrack/3.jpeg", "./carbontrack/4.jpeg"]
  },
  {
    "name": "LPC Invest",
    "url": "https://calorie-tracker-xi.vercel.app/",
    "desc": "LPC Invest is an innovative property investment company based in Manchester, boasting a portfolio of brand-new or recently completed properties. The project involves the development of a fully customized website designed to manage property listings, user interactions, blogs, calculators, city guides, and construction updates. Additionally, the project includes a comprehensive lead management dashboard integrated with Pipedrive and RingCentral for enhanced communication and streamlined processes.",
    "small_desc": "Real-estate Brokerage Company based in Manchester, UK ",
    "features": [
      {
        "name": "User Authentication / Profile Management",
        "detail": "Users can register and log in using their Spotify accounts. OAuth 2.0 authentication ensures secure and seamless login via Spotify."
      },
      {
        "name": "User Preferences",
        "detail": "Users can save favorite properties and access exclusive property listings and offers."
      },
      {
        "name": "Property Listings",
        "detail": "Extensive property listings with advanced filters, sorting options, and search functionality. Detailed property pages featuring comprehensive views, favorite options, exclusive tags, and integrated Google Maps to show nearby properties."
      },
      {
        "name": "Blogs",
        "detail": "Dynamic blog section with a rich text editor in the admin panel for creating and managing content."
      },
      {
        "name": "Calculators",
        "detail": "Mortgage calculator to help users estimate their loan repayments. Stamp duty calculator to assist users in calculating the stamp duty tax on property purchases."
      },
      {
        "name": "City Guide",
        "detail": "Dynamic city guide enabling the upload of PDFs, images, and text about various cities."
      },
      {
        "name": "Construction Updates",
        "detail": "Regular updates on ongoing construction projects, including images and videos."
      },
      {
        "name": "Static Pages and FAQs",
        "detail": "ROver 20 static informational pages. FAQs page to address common queries. Lead Dashboard"
      },
      {
        "name": "Lead Capturing and Storage",
        "detail": "Capturing leads from website forms, landing pages, mailers, and paid ads. Storing leads in the database and integrating with Pipedrive via APIs."
      },
      {
        "name": "Lead Management",
        "detail": "Custom dashboard for managing leads from various sources such as Facebook ads and other platforms. Advanced filtering options to organize and manage leads effectively."
      },
      {
        "name": "Pipedrive Automation",
        "detail": "Capturing leads using Pipedrive APIs. Automated person profile creation and lead filtering by source (mailer, ad, main website). Managed leads for both Manchester and Liverpool branches. Creation of custom fields in Pipedrive using APIs."
      },
      {
        "name": "RingCentral Integration",
        "detail": "Communication Enhancement:Integrated RingCentral APIs and Google Apps Script to enhance communication infrastructure. Real-time synchronization of call logs with Excel for efficient tracking and management. Third-Party APIs, APIs used for call log integration and synchronization."
      },
      {
        "name": "Google Maps",
        "detail": "Integrated to show property locations and nearby amenities."
      },
      {
        "name": "Microsoft Azure 360",
        "detail": "Integrated for additional services and functionalities."
      },
      {
        "name": "SMTP Mail",
        "detail": "For sending automated emails and notifications."
      }
    ],
    "tech_stack": ["HTML5", "CSS3", "Bootstrap 5", "AWS EC2", "Ubuntu", "Git", "MySQL"],
    "video": "./lpc/vid.mp4",
    "images": ["./lpc/1.jpg", "./lpc/2.jpg", "./lpc/3.jpg", "./lpc/4.jpg"]
  },
  {
    "name": "GitHub Metrics",
    "url": "https://calorie-tracker-xi.vercel.app/",
    "desc": "The GitHub Metrics Dashboard is a streamlined and efficient project management tool designed to integrate custom analytics for GitHub repositories. This dashboard provides summarized statistics widgets for issues, pull requests (PRs), and workflows, presented through interactive stats cards. The project leverages the GitHub API to fetch and visualize data, enhancing the user's ability to manage and monitor their repositories effectively. The application is deployed on AWS Elastic Beanstalk for scalability and reliability.",
    "small_desc": "The GitHub Metrics Dashboard is a streamlined and efficient project management tool designed to integrate custom analytics for GitHub repositories.",
    "features": [
      {
        "name": "Summarized Stat Widgets",
        "detail": "Issues: Displays the number of open, closed, and in-progress issues. Includes metrics such as average resolution time, most common issue tags, and top contributors. Pull Requests (PRs): Shows the status of pull requests (open, merged, closed). Includes metrics like average time to merge, most active contributors, and PR comments count. Workflows: Provides insights into CI/CD pipelines, including the number of successful, failed, and in-progress workflows. Tracks build times and success rates."
      },
      {
        "name": "Interactive Cards",
        "detail": "Interactive and clickable stats cards that provide detailed views and insights into each metric. Visual representation through charts and graphs for better data comprehension. Filtering options to view statistics by date ranges, tags, contributors, etc."
      },
      {
        "name": "Data Visualization",
        "detail": "Utilizes the GitHub API to fetch real-time data. Data visualization using libraries like D3.js or Chart.js for dynamic and interactive charts. Displays statistics in both graphical and tabular formats for comprehensive data analysis."
      },
      {
        "name": "Custom Analytics",
        "detail": "Customizable analytics to meet specific project needs. Ability to track and visualize trends over time, such as issue resolution rates and PR merge times. Advanced analytics for identifying bottlenecks and optimizing project workflows."
      },
      {
        "name": "Profile Management",
        "detail": "Integrated JWT authentication for secure login and session management. Profile management features allowing users to update their information and settings."
      },
      {
        "name": "Filters",
        "detail": "Advanced filters to show open and closed issues within a specified date range. Allows users to drill down into specific time periods for detailed analysis."
      },
      {
        "name": "Deployment",
        "detail": "Hosted on AWS Elastic Beanstalk, ensuring high availability and scalability. Automatic scaling to handle varying loads and ensure consistent performance. Secure and reliable deployment environment."
      }
    ],
    "tech_stack": ["Flask", "ChartJS", "React", "AWS EB", "AWS RDS", "Nginx", "Docker"],
    "video": "./gbase/vid.mp4",
    "images": ["./gbase/1.jpeg", "./gbase/2.jpeg", "./gbase/3.jpeg", "./gbase/1.jpeg"]
  },
  {
    "name": "S3-Enhanced Dynamic Data Visualization",
    "url": "https://calorie-tracker-xi.vercel.app/",
    "desc": "The S3-Enhanced Dynamic Data Visualization project is designed to provide interactive data visualization with advanced sorting and searching capabilities. The project seamlessly integrates AWS S3 for dynamic file handling, optimizing data retrieval, and uses RDS with PostgreSQL for efficient data management. Users can fetch and visualize data stored in their AWS S3 buckets, enabling comprehensive data analysis. The backend is developed using the Django framework, and the frontend UI is built with React.js.",
    "small_desc": "The S3-Enhanced Dynamic Data Visualization project is designed to provide interactive data visualization.",
    "features": [
      {
        "name": "AWS S3 Integration",
        "detail": "Fetch and integrate dynamic files from AWS S3. Users can select folders and files from their S3 buckets via the UI. Efficient data retrieval optimized for large datasets."
      },
      {
        "name": "Data Visualization",
        "detail": "Utilizes advanced data visualization techniques to analyze data fetched from S3. Supports various types of visualizations such as charts, graphs, and tables. Interactive visualization with features like sorting, searching, and filtering."
      },
      {
        "name": "User Authentication",
        "detail": "Token-based authentication for secure access. Users can log in and manage their profiles. Capability to add and manage their S3 account details."
      },
      {
        "name": "Dynamic Data Handling",
        "detail": "Real-time data processing and visualization. Advanced sorting and searching functionalities for data analysis. Ability to handle and visualize large datasets dynamically. Advanced analytics for identifying bottlenecks and optimizing project workflows."
      },
      {
        "name": "Backend",
        "detail": "Backend built using Django framework in Python for robustness and scalability. RDS with PostgreSQL for reliable and efficient data storage. Integration with AWS services for seamless data flow."
      },
      {
        "name": "Frontend",
        "detail": "Responsive and interactive UI built with React.js. Intuitive design to allow easy navigation and data interaction. Dynamic data selection and visualization options."
      },
      {
        "name": "Deployment",
        "detail": "Hosted on AWS Elastic Beanstalk, ensuring high availability and scalability. Automatic scaling to handle varying loads and ensure consistent performance. Secure and reliable deployment environment."
      }
    ],
    "tech_stack": ["Django", "Python", "ChartJS", "React", "AWS EB", "AWS RDS", "Nginx", "Git", "PostgreSQL ", "CI/CD"],
    "video": "false",
    "images": ["./s3/1.jpeg", "./s3/2.jpeg", "./s3/3.jpeg", "./s3/1.jpeg"]
  },
  {
    "name": "FLIP GIFT Cadeau Generator",
    "url": "https://www.generator.flippcadeau.nl/",
    "desc": "FLIP GIFT Cadeau Generator is a dynamic gift recommendation engine designed to provide personalized gift suggestions for various occasions. Users can select different categories and preferences such as gender, occasion, interests and age to receive tailored gift recommendations. The application leverages Django for backend development, React for the frontend, and AWS services for efficient and scalable deployment.",
    "small_desc": "FLIP GIFT Cadeau Generator is a dynamic gift recommendation engine designed to provide personalized gift suggestions for various occasions.",
    "features": [
      {
        "name": "Personalized Gift Recommendations",
        "detail": "Users can input preferences like gender, occasion, and age. The engine generates personalized gift suggestions based on the selected criteria."
      },
      {
        "name": "Category and Preferences",
        "detail": "Multiple categories and choices are available for users to filter their preferences. Options include various occasions (birthdays, anniversaries, holidays, etc.), gender (male, female, unisex), and age groups."
      },
      {
        "name": "Efficient Data Retrieval",
        "detail": "Utilized Django's pagination to handle large datasets and improve load times. Implemented caching mechanisms to enhance retrieval speed and reduce server load."
      },
      {
        "name": "User Experience",
        "detail": "Interactive and user-friendly interface built with React. Smooth navigation and quick response times to ensure a seamless user experience."
      },
      {
        "name": "Backend",
        "detail": "Backend developed using Django framework in Python. Data stored in MySQL database hosted on AWS RDS for reliability and scalability."
      },
      {
        "name": "Deployment and Storage",
        "detail": "Responsive and interactive UI built with React.js. Intuitive design to allow easy navigation and data interaction. Dynamic data selection and visualization options."
      },
      {
        "name": "Deployment",
        "detail": "Application hosted on AWS EC2 with Ubuntu for a stable and scalable environment. Media files and static assets stored on AWS S3 for efficient and secure access."
      }
    ],
    "tech_stack": ["Django", "Python", "ChartJS", "React", "AWS EC2", "AWS S3", "Nginx", "Git", "MySQL ", "Docker", "CI/CD"],
    "video": "false",
    "images": ["./giftgen/1.jpg", "./giftgen/2.jpg", "./giftgen/3.jpg", "./giftgen/4.jpg"]
  },
  {
    "name": "LendMe",
    "url": "https://lend-me-p2p.netlify.app/",
    "desc": "Welcome to LendMe, your trusted platform for peer-to-peer (P2P) lending and borrowing. Our application offers registered users a variety of P2P loan options tailored to their financial needs, whether they are looking to borrow or invest. Users can browse through a range of loan requests, filter by interest rates, and choose the best fit for their financial goals. Additionally, LendMe provides a seamless money transfer service through an in-app wallet, allowing users to receive and manage funds electronically.",
    "small_desc": "P2P Lending & Borrowing Fintech Solution.",
    "features": [
      {
        "name": "Personalized Loan",
        "detail": "Browse and filter loan requests by interest rates and terms."
      },
      {
        "name": "Dynamic Agreement",
        "detail": "Automated creation of loan agreements between borrowers and lenders, generated as PDFs."
      },
      {
        "name": "Payment Gateway",
        "detail": "Supports multiple payment methods for seamless transactions with Razorpay."
      },
      {
        "name": "In-App Wallet",
        "detail": "Securely manage your funds within the app with easy deposits, withdrawals, and transfers."
      },
      {
        "name": "User Authentication",
        "detail": "Secure login with JWT tokens and comprehensive profile management."
      },
      {
        "name": "Real-Time Data Monitoring",
        "detail": "Track the status of loans and investments with advanced analytics."
      },
      {
        "name": "Secure Data Encryption",
        "detail": "Protects sensitive information with robust encryption."
      }
    ],
    "tech_stack": ["Node.js", "PostgreSQL", "Razorpay", "React", "Git", "CI/CD"],
    "video": "false",
    "images": ["./lendme/1.jpg", "./lendme/2.jpg", "./lendme/3.jpg", "./lendme/4.jpg"]
  }
]
